cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
/**
  ******************************************************************************
  * @file    usbh_hid.c
  * @author  MCD Application Team
  * @brief   This file is the HID Layer Handlers for USB Host HID class.
  *
  * @verbatim
  *
  *          ===================================================================
  *                                HID Class  Description
  *          ===================================================================
  *           This module manages the HID class V1.11 following the "Device Class Definition
  *           for Human Interface Devices (HID) Version 1.11 Jun 27, 2001".
  *           This driver implements the following aspects of the specification:
  *             - The Boot Interface Subclass
  *             - The Mouse and Keyboard protocols
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* BSPDependencies
- "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
- "stm32xxxxx_{eval}{discovery}_io.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
- "stm32xxxxx_{eval}{discovery}_sdram.c"
EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include "usbh_hid.h"
#include "usbh_hid_parser.h"

#include <stdbool.h>
#include "config.h"
#include "timer.h"
#include "utils.h"
#define DEBUG_HIDREPORT_DESCRIPTOR
#ifdef DEBUG_HIDREPORT_DESCRIPTOR
#define DPRINTF(...) dprintf(DF_USB_REPORT, __VA_ARGS__)
#else
#define DPRINTF(...)
#endif

#undef DEBUG_HID_PROTOCOL
#ifdef DEBUG_HID_PROTOCOL
#define PPRINTF(...) dprintf(DF_USB, __VA_ARGS__);
#else
#define PPRINTF(...) do { } while (0)
#endif


/** @addtogroup USBH_LIB
* @{
*/

/** @addtogroup USBH_CLASS
* @{
*/

/** @addtogroup USBH_HID_CLASS
* @{
*/

/** @defgroup USBH_HID_CORE
* @brief    This file includes HID Layer Handlers for USB Host HID class.
* @{
*/

/** @defgroup USBH_HID_CORE_Private_TypesDefinitions
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Defines
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Macros
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Variables
* @{
*/

/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_FunctionPrototypes
* @{
*/

static USBH_StatusTypeDef USBH_HID_InterfaceInit(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost);
static void  USBH_HID_ParseHIDDesc(HID_DescTypeDef *desc, uint8_t *buf);

extern USBH_StatusTypeDef USBH_HID_MouseInit(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle);
extern USBH_StatusTypeDef USBH_HID_KeybdInit(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle);

USBH_ClassTypeDef  HID_Class =
{
  "HID",
  USB_HID_CLASS,
  NULL,
  USBH_HID_InterfaceInit,
  USBH_HID_InterfaceDeInit,
  USBH_HID_ClassRequest,
  USBH_HID_Process,
  USBH_HID_SOFProcess,
  NULL,
};
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Functions
* @{
*/


/** @defgroup USBH_HID_MOUSE_Private_Functions
  * @{
  */
void USBH_HID_Process_HIDReportDescriptor(USBH_HandleTypeDef *phost, HID_HandleTypeDef *HID_Handle)
{
    uint pos;
    uint desc_len = HID_Handle->HID_Desc.wItemLength;
    uint coll_depth = 0;
    uint8_t report_size = 0;  // in bits
    uint8_t report_count = 0;
    uint8_t usage_page = 0;
    uint16_t usage = 0;
    uint    bitpos = 0;  // First byte is usually record #
    uint    button = 0;
    uint    temp;
    uint    value;
    HID_RDescTypeDef *rd = &HID_Handle->HID_RDesc;
    uint16_t usage_array[16];
    uint8_t  usage_count = 0;
    uint8_t  report_id;
    const uint8_t *desc = (const uint8_t *) phost->device.Data;
#ifdef DEBUG_HIDREPORT_DESCRIPTOR
    const char *spaces = "                 ";
#endif
    DPRINTF("USB%u.%u.%u Process_HIDReportDescriptor rlen=%x\n",
            get_port(phost), phost->address, HID_Handle->interface, desc_len);

    if (desc_len > 512)
        desc_len = 512;  // Let's not go crazy here

    /* Request HID Report Descriptor (some mice require 20ms) */
    uint timeout = 100;
    while (USBH_HID_GetHIDReportDescriptor(phost, HID_Handle->interface,
                                           desc_len) != USBH_OK) {
        if (--timeout == 0) {
            printf("USB%u.%u.%u Get report descriptor failed\n",
                   get_port(phost), phost->address, HID_Handle->interface);
            return;
        }
        timer_delay_msec(1);
    }

#if 0
    for (pos = 0; pos < desc_len; pos++)
        printf(" %02x", desc[pos]);
    printf("\n");
#endif
    for (pos = 0; pos < desc_len; ) {
        const uint8_t tag = desc[pos] >> 4;
        const uint8_t type = (desc[pos] >> 2) & 3;
        const uint8_t size = desc[pos] & 3;

        if ((type == 0) && (tag == 0)) {
            pos++;
            continue;
        }
        DPRINTF("%02x:", pos);
        for (temp = 0; temp <= 2; temp++) {
            if (temp <= size) {
                DPRINTF(" %02x", desc[pos + temp]);
            } else {
                DPRINTF("   ");
            }
        }
        pos++;
        DPRINTF(" type %x tag %x size %x  ", type, tag, size);
        switch (type) {
            case HID_ITEM_TYPE_MAIN:  // type 0
                switch (tag) {
                    case HID_MAIN_ITEM_TAG_INPUT:
                        value = desc[pos];
                        DPRINTF("%.*s%s", coll_depth, spaces, "INPUT");
                        DPRINTF(" size=%u count=%u", report_size, report_count);
                        while ((usage_count < report_count) &&
                               (usage_count < ARRAY_SIZE(usage_array))) {
                            usage_array[usage_count++] = usage;
                        }
                        for (temp = 0; temp < report_count; temp++) {
                            int x = temp;
                            if (value & BIT(0)) {
                                /* Constant data */
                                DPRINTF(" C");
                            } else if (usage_page == HID_USAGE_PAGE_BUTTON) {
                                DPRINTF(" Button%u=%u", button, bitpos);
                                if (button < ARRAY_SIZE(rd->pos_button))
                                    rd->pos_button[button] = bitpos;
                                button++;
                                rd->num_buttons = button;
                            } else if (usage_page == HID_USAGE_PAGE_CONSUMER) {
                                DPRINTF(" Consumer usage=%x", usage_array[x]);
                                switch (usage_array[x]) {
                                    case 0x01:  // Generic control
                                        if (rd->num_keys <
                                            ARRAY_SIZE(rd->pos_key)) {
                                            rd->bits_key = report_size;
                                            rd->pos_key[rd->num_keys] = bitpos;
                                            rd->num_keys++;
                                        }
                                        DPRINTF(" key=%u", bitpos);
                                        break;
                                    case HID_USAGE_AC_PAN:
                                        DPRINTF(" AC_PAN=%u", bitpos);
                                        rd->pos_ac_pan = bitpos;
                                        rd->bits_ac_pan = report_size;
                                        break;
                                    default: {
                                        /* Attempt to handle as MM Button */
                                        uint num = rd->num_mmbuttons;
                                        if (report_size != 1)
                                            break;
                                        if (num >= ARRAY_SIZE(rd->val_mmbutton))
                                            break;
                                        DPRINTF(" MM %x %x=%u", num,
                                                usage_array[x], bitpos);
                                        rd->val_mmbutton[num] = usage_array[x];
                                        rd->pos_mmbutton[num] = bitpos;
                                        rd->id_mmbutton[num] = report_id;
                                        rd->num_mmbuttons++;
                                    }
                                }
                            } else if (x <= usage_count) {
                                switch (usage_array[x]) {
                                    case HID_USAGE_X:
                                        DPRINTF(" X=%u", bitpos);
                                        rd->pos_x = bitpos;
                                        rd->bits_x = report_size;
                                        break;
                                    case HID_USAGE_Y:
                                        DPRINTF(" Y=%u", bitpos);
                                        rd->pos_y = bitpos;
                                        rd->bits_y = report_size;
                                        break;
                                    case HID_USAGE_WHEEL:
                                        DPRINTF(" WHEEL=%u", bitpos);
                                        rd->pos_wheel = bitpos;
                                        rd->bits_wheel = report_size;
                                        break;
                                    case HID_USAGE_SYSCTL:
                                    case HID_USAGE_SLEEP:
                                    case HID_USAGE_PWDOWN:
                                    case HID_USAGE_WAKEUP:
                                        DPRINTF(" SYSCTL=%u", bitpos);
                                        rd->pos_sysctl = bitpos;
                                        rd->bits_sysctl = report_size;
                                        if (rd->bits_sysctl > 16)
                                            rd->bits_sysctl = 16;
                                        break;
                                }
                            }
                            bitpos += report_size;
                        }
                        break;
                    case HID_MAIN_ITEM_TAG_OUTPUT:
                        DPRINTF("%.*s%s", coll_depth, spaces, "OUTPUT");
                        // End output feature
                        break;
                    case HID_MAIN_ITEM_TAG_COLLECTION:
                        DPRINTF("%.*s%s", coll_depth, spaces, "COLL");
                        coll_depth++;
                        break;
                    case HID_MAIN_ITEM_TAG_FEATURE:
                        DPRINTF("%.*s%s", coll_depth, spaces, "FEATURE");
                        break;
                    case HID_MAIN_ITEM_TAG_ENDCOLLECTION:
                        if (coll_depth > 0)
                            coll_depth--;
                        if (coll_depth == 0) {
                            bitpos = 0;
                            usage = 0;
                            report_count = 0;
                        }
                        DPRINTF("%.*s%s", coll_depth, spaces, "END COLL");
                        break;
                }
                usage_count = 0;
                break;
            case HID_ITEM_TYPE_GLOBAL:  // type 1
                switch (tag) {
                    case HID_GLOBAL_ITEM_TAG_USAGE_PAGE:
                        usage_page = desc[pos];
                        DPRINTF("%.*s%s", coll_depth, spaces, "USAGE PAGE");
                        switch (usage_page) {
                            case HID_USAGE_PAGE_GEN_DES:
                                /* Mouse X, Y */
                                DPRINTF(" Generic Desktop");
                                break;
                            case HID_USAGE_PAGE_GAME_CTR:
                                DPRINTF(" Game Controller");
                                break;
                            case HID_USAGE_PAGE_KEYB:
                                DPRINTF(" Keyboard");
                                break;
                            case HID_USAGE_PAGE_LED:
                                DPRINTF(" LED");
                                break;
                            case HID_USAGE_PAGE_BUTTON:
                                DPRINTF(" Button");
                                break;
                            case HID_USAGE_PAGE_CONSUMER:
                                DPRINTF(" Consumer");
                                break;
                            case HID_USAGE_PAGE_BARCODE:
                                DPRINTF(" Barcode");
                                break;
                        }
                        break;
                    case HID_GLOBAL_ITEM_TAG_LOG_MIN:
                        DPRINTF("%.*s%s", coll_depth, spaces, "LOG MIN");
                        break;
                    case HID_GLOBAL_ITEM_TAG_LOG_MAX:
                        DPRINTF("%.*s%s", coll_depth, spaces, "LOG MAX");
                        break;
                    case HID_GLOBAL_ITEM_TAG_PHY_MIN:
                        DPRINTF("%.*s%s", coll_depth, spaces, "PHY MIN");
                        break;
                    case HID_GLOBAL_ITEM_TAG_PHY_MAX:
                        DPRINTF("%.*s%s", coll_depth, spaces, "PHY MAX");
                        break;
                    case HID_GLOBAL_ITEM_TAG_UNIT_EXPONENT:
                        DPRINTF("%.*s%s", coll_depth, spaces, "UNIT EXP");
                        break;
                    case HID_GLOBAL_ITEM_TAG_UNIT:
                        DPRINTF("%.*s%s", coll_depth, spaces, "UNIT");
                        break;
                    case HID_GLOBAL_ITEM_TAG_REPORT_SIZE:
                        report_size = desc[pos];  // bits per report
                        DPRINTF("%.*s%s", coll_depth, spaces, "REP SIZE");
                        DPRINTF("=%u bits", report_size);
                        break;
                    case HID_GLOBAL_ITEM_TAG_REPORT_ID:
                        DPRINTF("%.*s%s", coll_depth, spaces, "REP ID");
                        DPRINTF("=%u", desc[pos]);
                        report_id = desc[pos];
                        switch (usage_page) {
                            case HID_USAGE_PAGE_GEN_DES:
                                switch (usage) {
                                    case HID_USAGE_POINTER:
                                    case HID_USAGE_MOUSE:
                                        rd->id_mouse = report_id;
                                        break;
                                    case HID_USAGE_SYSCTL:
                                        rd->id_sysctl = report_id;
                                        break;
                                }
                                break;
                            case HID_USAGE_PAGE_CONSUMER:
                                rd->id_consumer = report_id;
                                break;
                        }
                        bitpos += 8;
                        break;
                    case HID_GLOBAL_ITEM_TAG_REPORT_COUNT:
                        report_count = desc[pos];  // number of reports
                        DPRINTF("%.*s%s", coll_depth, spaces, "REP COUNT");
                        DPRINTF("=%u", report_count);
                        break;
                    case HID_GLOBAL_ITEM_TAG_PUSH:
                        DPRINTF("%.*s%s", coll_depth, spaces, "PUSH");
                        break;
                    case HID_GLOBAL_ITEM_TAG_POP:
                        DPRINTF("%.*s%s", coll_depth, spaces, "POP");
                        break;
                        break;
                }
                break;
            case HID_ITEM_TYPE_LOCAL:  // type 2
                switch (tag) {
                    case HID_LOCAL_ITEM_TAG_USAGE:
                        DPRINTF("%.*s%s", coll_depth, spaces, "USAGE");
                        if (size == 1)
                            usage = desc[pos];
                        else
                            usage = desc[pos] | (desc[pos + 1] << 8);
                        switch (usage_page) {
                            case HID_USAGE_PAGE_GEN_DES:
                                switch (usage) {
                                    case HID_USAGE_POINTER:
                                        DPRINTF(" Pointer");
                                        break;
                                    case HID_USAGE_MOUSE:
                                        DPRINTF(" Mouse");
                                        break;
                                    case HID_USAGE_JOYSTICK:
                                        DPRINTF(" Joystick");
                                        break;
                                    case HID_USAGE_GAMEPAD:
                                        DPRINTF(" Gamepad");
                                        break;
                                    case HID_USAGE_KBD:
                                        DPRINTF(" Keyboard");
                                        break;
                                    case HID_USAGE_X:
                                        DPRINTF(" X");
                                        break;
                                    case HID_USAGE_Y:
                                        DPRINTF(" Y");
                                        break;
                                    case HID_USAGE_WHEEL:
                                        DPRINTF(" WHEEL");
                                        break;
                                    case HID_USAGE_SYSCTL:
                                        DPRINTF(" SYSCTL");
                                        break;
                                    case HID_USAGE_PWDOWN:
                                        DPRINTF(" PWDOWN");
                                        break;
                                    case HID_USAGE_SLEEP:
                                        DPRINTF(" SLEEP");
                                        break;
                                    case HID_USAGE_WAKEUP:
                                        DPRINTF(" WAKEUP");
                                        break;
                                }
                                break;
                            case HID_USAGE_PAGE_CONSUMER:
                                switch (usage) {
                                    case 0x01:
                                        DPRINTF(" Control");
                                        break;
                                    case HID_USAGE_AC_PAN:
                                        DPRINTF(" AC_PAN");
                                        break;
                                }
                                break;
                        }
                        if (coll_depth == 0) {
                            if (rd->usage == 0)
                                rd->usage = usage;
                        } else {
                            if (usage_count < ARRAY_SIZE(usage_array))
                                usage_array[usage_count++] = usage;
                        }
                        break;
                    case HID_LOCAL_ITEM_TAG_USAGE_MIN:
                        DPRINTF("%.*s%s", coll_depth, spaces, "USAGEMIN");
                        break;
                    case HID_LOCAL_ITEM_TAG_USAGE_MAX:
                        DPRINTF("%.*s%s", coll_depth, spaces, "USAGEMAX");
                        break;
                    case HID_LOCAL_ITEM_TAG_DESIGNATOR_INDEX:
                        DPRINTF("%.*s%s", coll_depth, spaces, "DES INDEX");
                        break;
                    case HID_LOCAL_ITEM_TAG_DESIGNATOR_MIN:
                        DPRINTF("%.*s%s", coll_depth, spaces, "DES MIN");
                        break;
                    case HID_LOCAL_ITEM_TAG_DESIGNATOR_MAX:
                        DPRINTF("%.*s%s", coll_depth, spaces, "DES MAX");
                        break;
                    case HID_LOCAL_ITEM_TAG_STRING_INDEX:
                    case HID_LOCAL_ITEM_TAG_STRING_MIN:
                    case HID_LOCAL_ITEM_TAG_STRING_MAX:
                    case HID_LOCAL_ITEM_TAG_DELIMITER:
                        DPRINTF("%.*s%s", coll_depth, spaces, "DELIM");
                        break;
                        break;
                }
                break;
            case HID_ITEM_TYPE_RESERVED:  // type 3
                break;
        }
        DPRINTF("\n");
        pos += size;
    }
}


void timer_delay_msec(uint msec);
#define BIT(x) (1U << (x))


static USBH_StatusTypeDef USBH_HID_InterfaceInit_ll(USBH_HandleTypeDef *phost, uint8_t interface)
{
  USBH_StatusTypeDef status;
  HID_HandleTypeDef *HID_Handle;
  uint8_t max_ep;
  uint8_t num = 0U;

