cdhooper/amigapci_stm32/fw/cubemx/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
  status = USBH_SelectInterface(phost, interface);

  if (status != USBH_OK)
  {
    return USBH_FAIL;
  }

  HID_Handle = (HID_HandleTypeDef *)USBH_malloc(sizeof(HID_HandleTypeDef));
  if (HID_Handle == NULL)
  {
    USBH_DbgLog("Cannot allocate memory for HID Handle");
    return USBH_FAIL;
  }

  /* Initialize hid handler */
  USBH_memset(HID_Handle, 0, sizeof(HID_HandleTypeDef));

#if 0
  /* pData list in reverse order */
  HID_Handle->next = phost->pActiveClass->pData;
  phost->pActiveClass->pData = HID_Handle;
#else
  /*
   * pData list must be in insertion order because some HID devices
   * such as the Dell USB Hub Keyboard require that interfaces be
   * processed in order.
   */
  HID_HandleTypeDef *prev = (HID_HandleTypeDef *) phost->pActiveClass->pData;

  HID_Handle->next = NULL;

  if (prev == NULL) {
    phost->pActiveClass->pData = HID_Handle;
  } else {
    while (prev->next != NULL)
        prev = prev->next;
    prev->next = HID_Handle;
  }
#endif

  HID_Handle->interface = interface;
  HID_Handle->state = HID_NO_SUPPORT;

  /* Decode Bootclass Protocol: Mouse or Keyboard */
  if (phost->device.CfgDesc.Itf_Desc[interface].bInterfaceProtocol == HID_KEYBRD_BOOT_CODE)
  {
    USBH_UsrLog("USB%u.%u.%u Keyboard device found", get_port(phost), phost->address, interface);
    HID_Handle->Init = USBH_HID_KeybdInit;
  }
  else if (phost->device.CfgDesc.Itf_Desc[interface].bInterfaceProtocol == HID_MOUSE_BOOT_CODE)
  {
    USBH_UsrLog("USB%u.%u.%u Mouse device found", get_port(phost), phost->address, interface);
    HID_Handle->Init = USBH_HID_MouseInit;
  }
  else
  {
    USBH_UsrLog("USB%u.%u.%u Generic device found", get_port(phost), phost->address, interface);
#if 0
    USBH_UsrLog("Protocol not supported.");
    return USBH_FAIL;
#endif
    HID_Handle->Init = USBH_HID_GenericInit;
  }

  HID_Handle->state     = HID_INIT;
  HID_Handle->ctl_state = HID_REQ_INIT;
  HID_Handle->ep_addr   = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress;
  HID_Handle->length    = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].wMaxPacketSize;
  HID_Handle->length_max = phost->device.DevDesc.bMaxPacketSize;
  HID_Handle->poll      = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bInterval;

  if (HID_Handle->poll  < HID_MIN_POLL)
  {
    HID_Handle->poll = HID_MIN_POLL;
  }

  /* Check fo available number of endpoints */
  /* Find the number of EPs in the Interface Descriptor */
  /* Choose the lower number in order not to overrun the buffer allocated */
  max_ep = ((phost->device.CfgDesc.Itf_Desc[interface].bNumEndpoints <= USBH_MAX_NUM_ENDPOINTS) ?
             phost->device.CfgDesc.Itf_Desc[interface].bNumEndpoints : USBH_MAX_NUM_ENDPOINTS);


  /* Decode endpoint IN and OUT address from interface descriptor */
  for (num = 0U; num < max_ep; num++)
  {
    if (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress & 0x80U)
    {
      HID_Handle->InEp = (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress);
      HID_Handle->InPipe = USBH_AllocPipe(phost, HID_Handle->InEp);

      /* Open pipe for IN endpoint */
      USBH_OpenPipe(phost, HID_Handle->InPipe, HID_Handle->InEp, phost->device.address,
                    phost->device.speed, USB_EP_TYPE_INTR, HID_Handle->length_max);

      USBH_LL_SetToggle(phost, HID_Handle->InPipe, 0U);
    }
    else
    {
      HID_Handle->OutEp = (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress);
      HID_Handle->OutPipe  = USBH_AllocPipe(phost, HID_Handle->OutEp);

      /* Open pipe for OUT endpoint */
      USBH_OpenPipe(phost, HID_Handle->OutPipe, HID_Handle->OutEp, phost->device.address,
                    phost->device.speed, USB_EP_TYPE_INTR, HID_Handle->length);

      USBH_LL_SetToggle(phost, HID_Handle->OutPipe, 0U);
    }
  }

  return USBH_OK;
}

/**
  * @brief  USBH_HID_InterfaceInit
  *         The function init the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_InterfaceInit(USBH_HandleTypeDef *phost)
{
  uint8_t interface;
  USBH_StatusTypeDef status = USBH_FAIL;
  USBH_StatusTypeDef t_status;
  uint numif = phost->device.CfgDesc.bNumInterfaces;

  if (numif > USBH_MAX_NUM_INTERFACES)
      numif = USBH_MAX_NUM_INTERFACES;
  for (interface = 0; interface < numif; interface++) {
      t_status = USBH_HID_InterfaceInit_ll(phost, interface);
      if (t_status == USBH_OK)
          status = t_status;
  }

  if (status == USBH_FAIL) { /* No Valid Interface */
    USBH_DbgLog("Cannot Find the interface for %s class.", phost->pActiveClass->Name);
  }
  return (status);
}

static USBH_StatusTypeDef USBH_HID_InterfaceDeInit_ll(USBH_HandleTypeDef *phost)
{
  HID_HandleTypeDef *HID_Handle = (HID_HandleTypeDef *) phost->pActiveClass->pData;

  if (HID_Handle == NULL)
    return USBH_FAIL;

  if (HID_Handle->InPipe != 0x00U)
  {
    USBH_LL_StopHC(phost, HID_Handle->InPipe);

    USBH_ClosePipe(phost, HID_Handle->InPipe);
    USBH_FreePipe(phost, HID_Handle->InPipe);
    HID_Handle->InPipe = 0U;     /* Reset the pipe as Free */
  }

  if (HID_Handle->OutPipe != 0x00U)
  {
    USBH_LL_StopHC(phost, HID_Handle->OutPipe);

    USBH_ClosePipe(phost, HID_Handle->OutPipe);
    USBH_FreePipe(phost, HID_Handle->OutPipe);
    HID_Handle->OutPipe = 0U;     /* Reset the pipe as Free */
  }

  phost->pActiveClass->pData = HID_Handle->next;
  USBH_free(HID_Handle);

  return USBH_OK;
}

/**
  * @brief  USBH_HID_InterfaceDeInit
  *         The function DeInit the Pipes used for the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit(USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef status = USBH_FAIL;

  while (phost->pActiveClass->pData != NULL)
    status = USBH_HID_InterfaceDeInit_ll(phost);

